   1 const menuData = {
    2     "サンド": [
    3         { name: "スモークチキンサンド", price: 680 },
    4         { name: "スモークチキンホットサンド", price: 680 }
    5     ],
    6     "グラノーラ": [
    7         { name: "ベーシックグラノーラ", price: 320 },
    8         { name: "黒蜜きなこグラノーラ", price: 430 }
    9     ],
   10     "ワッフル": [
   11         { name: "プレーン", price: 180 },
   12         { name: "チョコチップ", price: 250 },
   13         { name: "シトラス", price: 270 },
   14         { name: "抹茶ブルーベリー", price: 270 },
   15         { name: "抹茶", price: 250 }
   16     ],
   17     "名水ソーダ": [
   18         { name: "ゴールデンキウイ", price: 400 },
   19         { name: "パイナップル", price: 400 },
   20         { name: "クラフトコーラ", price: 400 }
   21     ],
   22     "トッピング": [
   23         { name: "アイスクリームトッピング", price: 250 }
   24     ],
   25     "雑貨": [
   26         { name: "手ぬぐい", price: 1100 },
   27         { name: "ステッカー", price: 100 }
   28     ],
   29     "イベントメニュー": [
   30         { name: "ポップソーダクッキー", price: 800 }
   31     ]
   32 };
