 const menuData = {
     "サンド": [
         { name: "スモークチキンサンド", price: 680 },
         { name: "スモークチキンホットサンド", price: 680 }
     ],
     "グラノーラ": [
         { name: "ベーシックグラノーラ", price: 320 },
         { name: "黒蜜きなこグラノーラ", price: 430 }
     ],
     "ワッフル": [
         { name: "プレーン", price: 180 },
         { name: "チョコチップ", price: 250 },
         { name: "シトラス", price: 270 },
         { name: "抹茶ブルーベリー", price: 270 },
         { name: "抹茶", price: 250 }
     ],
     "名水ソーダ": [
         { name: "ゴールデンキウイ", price: 400 },
         { name: "パイナップル", price: 400 },
         { name: "クラフトコーラ", price: 400 }
     ],
     "トッピング": [
         { name: "アイスクリームトッピング", price: 250 }
     ],
     "雑貨": [
         { name: "手ぬぐい", price: 1100 },
         { name: "ステッカー", price: 100 }
     ],
     "イベントメニュー": [
         { name: "ポップソーダクッキー", price: 800 }
     ]
 };
